return {
  'goolord/alpha-nvim',
  vim.keymap.set('n', '<leader>A', ':Alpha<CR>'),
  dependencies = {
    'echasnovski/mini.icons',
  },

  config = function()
    local alpha = require 'alpha'
    local dashboard = require 'alpha.themes.dashboard'

    dashboard.section.header.val = {
      'πππππππππππ=÷÷÷ππππππ÷÷××÷≠ππππππ÷÷÷÷÷÷÷÷÷÷×≠πππ',
      'ππππππππππ×÷÷÷÷÷√ππππ÷÷÷××÷πππππ√÷÷÷≠÷÷÷÷≠×÷≠πππ',
      'πππππππππππ÷÷÷×÷÷÷÷÷÷÷÷×÷÷×÷÷÷÷××÷×÷×÷≈÷≠÷×÷≠πππ',
      'ππππππππππππ÷×≠÷÷÷÷÷÷÷÷=÷×÷÷×÷×÷÷÷÷÷÷÷≠×=×××÷πππ',
      'πππ√÷÷∞πππ∞÷÷÷÷÷÷÷≠≠----+---≈×÷÷÷÷÷÷×÷×××÷×-÷√ππ',
      'ππ√÷÷÷÷÷÷÷÷×÷÷×≠-----÷÷××÷----÷-×÷÷÷×××××÷÷÷×≈ππ',
      'πππ×××÷÷≠÷÷÷÷≠-----÷-=÷÷==≠÷××-----÷÷-×÷××∞π÷≠ππ',
      'πππππ÷÷÷÷÷≠=---×-÷÷÷×÷=≠≠∞∞∞≠=×----÷=×-×-πππππππ',
      'ππππππ÷÷÷÷÷-----×--=≠÷≠÷÷÷∞≠=≠------÷----πππππππ',
      'πππππ√÷÷÷÷≠-×-÷=×-÷==×÷÷≈≈≈∞≈≠=------×-×-×ππππππ',
      '÷÷÷≠-××÷÷÷---÷-÷∞≠≠≈∞≠=≠≠≈≠≈≠≈≠×-----÷×-×--×××÷÷',
      '÷×÷×=≠≈÷÷×---×--≠=-×-≠-=≠≠-≈÷-÷÷×----÷×--÷÷-×××÷',
      '××--×××=÷÷----÷≈÷-≈π∞-≠÷÷------≠÷÷≠×-=×-××××-××=',
      'πππππ√÷÷×÷=----×-÷-÷-÷--÷≈××÷÷≈≠≠----÷×-×-ππππππ',
      'ππππππ××=×÷----×---------÷=-×××-××---×-××√ππππππ',
      'πππππ×-×××÷----+---÷÷×-×=÷÷---=----÷--××××ππππππ',
      'πππ≠×÷÷×=×××÷=--------×÷≈≠÷----÷--÷×÷÷-×÷××-≠πππ',
      'πππ÷×××××××--×÷≈-------÷÷÷÷-×---÷÷××-×××××-×-πππ',
      'ππππ-×=πππ≈×××÷×××÷---------÷÷××÷××-÷ππππ---ππππ',
      'ππππππππππππ÷÷=÷×××÷÷÷×==×÷÷×××××÷÷÷ππππππππππππ',
      'πππππππππππ÷×=×××÷×=-×××××××÷÷×××÷÷÷∞πππππππππππ',
      'ππππππππππ÷÷××÷×∞πππ√×÷×××÷ππππ×=×-××πππππππππππ',
      'πππππππππππ÷×××ππππππ×××××∞πππππ√×××√πππππππππππ',
    }

    dashboard.section.buttons.val = {
      dashboard.button('<leader>fr', '  Recently opened files'),
      dashboard.button('<leader>oA', '  Open org-agenda'),
      dashboard.button('<leader>pp', '  Open project'),
      dashboard.button('<leader>fP', '  Open private configuration', ':e $MYVIMRC | :cd %:p:h | split . | wincmd k | pwd<CR>'),
    }

    dashboard.section.footer.val = { 'May the machine spirit be pleased by your work.' }

    alpha.setup(dashboard.opts)
  end,
}
